In [1]:
# Import above dataset

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv("Tit.csv")

In [4]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
#Remove ‘Ticket’ and ‘Cabin’ feature

In [6]:
data.columns.drop(['Ticket',"Cabin"])

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Embarked'],
      dtype='object')

In [7]:
#Determine the number of male and female survivors and non-survivors.

In [8]:
data.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [9]:
print("Survivors male : ",data[(data['Survived'] >  0 ) & (data['Sex'] == "male")].count())

Survivors male :  PassengerId    109
Survived       109
Pclass         109
Name           109
Sex            109
Age             93
SibSp          109
Parch          109
Ticket         109
Fare           109
Cabin           45
Embarked       109
dtype: int64

In [10]:
Survivors_male=data[(data['Survived'] >  0 ) & (data['Sex'] == "male")]

In [11]:
Survivors_male['Survived'].sum()

109

In [12]:
print("Survivors female  ->",data[(data['Survived'] > 0   ) & (data['Sex'] == "female")].count())

Survivors female  -> PassengerId    233
Survived       233
Pclass         233
Name           233
Sex            233
Age            197
SibSp          233
Parch          233
Ticket         233
Fare           233
Cabin           91
Embarked       231
dtype: int64

In [13]:
Survivors_female=data[(data['Survived'] >  0 ) & (data['Sex'] == "female")]

In [14]:
Survivors_female['Survived'].sum()

233

In [15]:
data.groupby(['Sex','Survived'])['Survived'].count()

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
Name: Survived, dtype: int64

In [16]:
#Calculate the first-class survivalrate  :

In [17]:
Survivors_first_class = data[(data['Survived'] > 0   ) & (data['Pclass'] >=1 )]

In [18]:
print("Survivors first-class  ->",data[(data['Survived'] > 0   ) & (data['Pclass'] >=1 )].count())

Survivors first-class  -> PassengerId    342
Survived       342
Pclass         342
Name           342
Sex            342
Age            290
SibSp          342
Parch          342
Ticket         342
Fare           342
Cabin          136
Embarked       340
dtype: int64

In [19]:
Survivors_first_class['Survived'].sum()

342

In [20]:
# The rescue crew is trying to figure out how many passengers did not have siblings on board.

In [21]:
passengers_not_have_siblings=data[(data['SibSp'] >= 0)]

In [22]:
passengers_not_have_siblings['SibSp'].sum()

466

In [23]:
# Create a method to extract the words'Mr. Mrs. Master. Miss.' from the 'Name' column and save them in a new fieldnamed 'Category’. 'SepSur' is the function name.

In [24]:
data['Category']=0
for i in data:
    data['Category']=data.Name.str.extract('([A-Za-z]+)\.')

In [25]:

(data['Category'].replace(['Mlle','Mme','Ms','Dr','Major','Lady','Countess','Jonkheer','Col','Rev','Capt','Sir','Don'],['Miss','Miss','Miss','Mr','Mr','Mrs','Mrs','Other','Other','Other','Mr','Mr','Mr'],inplace=True))

In [26]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Category
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr

In [27]:
data[['Category',"Name"]]

    Category                                               Name
0         Mr                            Braund, Mr. Owen Harris
1        Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2       Miss                             Heikkinen, Miss. Laina
3        Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         Mr                           Allen, Mr. William Henry
..       ...                                                ...
886    Other                              Montvila, Rev. Juozas
887     Miss                       Graham, Miss. Margaret Edith
888     Miss           Johnston, Miss. Catherine Helen "Carrie"
889       Mr                              Behr, Mr. Karl Howell
890       Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [28]:
#Find the average age of 'Mr', 'Mrs',2'Miss', 'Master', None, 'Dr' 'Category' survivors.

In [29]:
data.groupby('Initial')['Age'].mean()

KeyError: 'Initial'

In [ ]:
Survivors_female_age=data[(data['Survived'] >  0 ) & (data['Sex'] == "female") & (data['Age'] >=20) & (data['Age'] <=60)].count()

In [ ]:
Survivors_female_age